[
     {
        "title": "HASHIRU: Hierarchical Agent System for Hybrid Intelligent Resource Utilization",
        "authors": [
            "Kunal Pai",
            "Parth Shah",
            "Harshil Patel"
        ],
        "type": "paper",
        "description": "Rapid Large Language Model (LLM) advancements are fueling autonomous Multi-Agent System (MAS) development. However, current frameworks often lack flexibility, resource awareness, model diversity, and autonomous tool creation. This paper introduces HASHIRU (Hierarchical Agent System for Hybrid Intelligent Resource Utilization), a novel MAS framework enhancing flexibility, resource efficiency, and adaptability. HASHIRU features a \"CEO\" agent dynamically managing specialized \"employee\" agents, instantiated based on task needs and resource constraints (cost, memory). Its hybrid intelligence prioritizes smaller, local LLMs (via Ollama) while flexibly using external APIs and larger models when necessary. An economic model with hiring/firing costs promotes team stability and efficient resource allocation. The system also includes autonomous API tool creation and a memory function. Evaluations on tasks like academic paper review (58% success), safety assessments (100% on a JailbreakBench subset), and complex reasoning (outperforming Gemini 2.0 Flash on GSM8K: 96% vs. 61%; JEEBench: 80% vs. 68.3%; SVAMP: 92% vs. 84%) demonstrate HASHIRU's capabilities. Case studies illustrate its self-improvement via autonomous cost model generation, tool integration, and budget management. HASHIRU offers a promising approach for more robust, efficient, and adaptable MAS through dynamic hierarchical control, resource-aware hybrid intelligence, and autonomous functional extension. Source code and benchmarks are available at this https URL and this https URL respectively, and a live demo is available at this https URL upon request.",
        "conference": "arXiv",
        "tags": [
            "Agentic AI",
            "GenAI",
            "MultiAgent Framework"
        ],
        "link": "https://arxiv.org/abs/2506.04255"
    },
    {
        "title": "gem5 Vision",
        "authors": [
            "Parth Shah",
            "Kunal Pai",
            "Harshil Patel",
            "Arslan Ali"
        ],
        "type": "poster",
        "description": "The gem5 Vision Project seeks to improve user-friendliness and accessibility by introducing advanced search functionality, comprehensive resource categorization, and expanded database support within the gem5 ecosystem for researchers and developers.",
        "conference": "ISCA 2023: gem5 Workshop",
        "tags": [
            "Computer Architecture"
        ],
        "link": "https://www.gem5.org/assets/files/workshop-isca-2023/posters/gem5-vision-poster.pdf"
    }
]
